Ran Plan for dir: `eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac` workspace: `default`

<details><summary>Show Output</summary>

```diff
18:22:42.248 INFO   Terragrunt Cache server is listening on 127.0.0.1:40009
18:22:42.248 INFO   Start Terragrunt Cache server
18:22:42.329 INFO   Downloading Terraform configurations from tfr:///terraform-google-modules/cloud-storage/google?version=10.0.2 into ./.terragrunt-cache/hvZ4TccnBYkUfk0zrDgxe7E1ZmE/nMzp8HmAhZY0B79QE6g812IfclE
18:22:43.408 INFO   Caching terraform providers for ./.terragrunt-cache/hvZ4TccnBYkUfk0zrDgxe7E1ZmE/nMzp8HmAhZY0B79QE6g812IfclE/modules/simple_bucket
18:22:45.459 INFO   Cached registry.terraform.io/hashicorp/google v6.38.0 (signed by HashiCorp)
18:22:45.591 INFO   terraform: Initializing the backend...
18:22:45.837 INFO   terraform: Initializing modules...
18:22:45.841 INFO   terraform: Initializing provider plugins...
18:22:45.841 INFO   terraform: - Reusing previous version of hashicorp/google from the dependency lock file
18:22:45.847 INFO   terraform: - Installing hashicorp/google v6.38.0...
18:22:46.029 INFO   terraform: - Installed hashicorp/google v6.38.0 (unauthenticated)
18:22:46.029 INFO   terraform: Terraform has been successfully initialized!
18:22:46.029 INFO   terraform: 
18:22:46.029 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
18:22:46.029 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
18:22:46.029 INFO   terraform: should now work.
18:22:46.029 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
18:22:46.029 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
18:22:46.030 INFO   terraform: commands will detect it and remind you to do so if necessary.
18:22:47.308 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Reading...
18:22:47.471 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-538311360123@gs-project-accounts.iam.gserviceaccount.com]
18:22:47.525 STDOUT terraform: Terraform used the selected providers to generate the following execution
18:22:47.525 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
18:22:47.525 STDOUT terraform:   + create
18:22:47.525 STDOUT terraform: Terraform will perform the following actions:
18:22:47.525 STDOUT terraform:   # google_storage_bucket.bucket will be created
18:22:47.525 STDOUT terraform:   + resource "google_storage_bucket" "bucket" {
18:22:47.525 STDOUT terraform:       + effective_labels            = {
18:22:47.525 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
18:22:47.525 STDOUT terraform:           + "owner"                      = "infrastructure"
18:22:47.525 STDOUT terraform:           + "service-name"               = "testing-iac"
18:22:47.525 STDOUT terraform:         }
18:22:47.525 STDOUT terraform:       + force_destroy               = true
18:22:47.525 STDOUT terraform:       + id                          = (known after apply)
18:22:47.525 STDOUT terraform:       + labels                      = {
18:22:47.525 STDOUT terraform:           + "owner"        = "infrastructure"
18:22:47.525 STDOUT terraform:           + "service-name" = "testing-iac"
18:22:47.525 STDOUT terraform:         }
18:22:47.525 STDOUT terraform:       + location                    = "US-CENTRAL1"
18:22:47.526 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac-20250606"
18:22:47.526 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
18:22:47.526 STDOUT terraform:       + project_number              = (known after apply)
18:22:47.526 STDOUT terraform:       + public_access_prevention    = "inherited"
18:22:47.526 STDOUT terraform:       + rpo                         = (known after apply)
18:22:47.526 STDOUT terraform:       + self_link                   = (known after apply)
18:22:47.526 STDOUT terraform:       + storage_class               = "REGIONAL"
18:22:47.526 STDOUT terraform:       + terraform_labels            = {
18:22:47.526 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
18:22:47.526 STDOUT terraform:           + "owner"                      = "infrastructure"
18:22:47.526 STDOUT terraform:           + "service-name"               = "testing-iac"
18:22:47.526 STDOUT terraform:         }
18:22:47.526 STDOUT terraform:       + time_created                = (known after apply)
18:22:47.526 STDOUT terraform:       + uniform_bucket_level_access = true
18:22:47.527 STDOUT terraform:       + updated                     = (known after apply)
18:22:47.527 STDOUT terraform:       + url                         = (known after apply)
18:22:47.527 STDOUT terraform:       + autoclass {
18:22:47.527 STDOUT terraform:           + enabled                = false
18:22:47.527 STDOUT terraform:           + terminal_storage_class = (known after apply)
18:22:47.527 STDOUT terraform:         }
18:22:47.527 STDOUT terraform:       + soft_delete_policy {
18:22:47.527 STDOUT terraform:           + effective_time             = (known after apply)
18:22:47.527 STDOUT terraform:           + retention_duration_seconds = 604800
18:22:47.527 STDOUT terraform:         }
18:22:47.527 STDOUT terraform:       + versioning {
18:22:47.527 STDOUT terraform:           + enabled = false
18:22:47.527 STDOUT terraform:         }
18:22:47.527 STDOUT terraform:       + website (known after apply)
18:22:47.527 STDOUT terraform:     }
18:22:47.527 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
18:22:47.565 STDOUT terraform: 
18:22:47.565 STDOUT terraform: Changes to Outputs:
18:22:47.565 STDOUT terraform:   + apphub_service_uri         = {
18:22:47.565 STDOUT terraform:       + location    = "us-central1"
18:22:47.565 STDOUT terraform:       + service_id  = "eitch-demo-atlantis-terragrunt-testing-iac-20250606"
18:22:47.566 STDOUT terraform:       + service_uri = (known after apply)
18:22:47.566 STDOUT terraform:     }
18:22:47.566 STDOUT terraform:   + bucket                     = {
18:22:47.566 STDOUT terraform:       + autoclass                   = [
18:22:47.566 STDOUT terraform:           + {
18:22:47.566 STDOUT terraform:               + enabled                = false
18:22:47.566 STDOUT terraform:               + terminal_storage_class = (known after apply)
18:22:47.566 STDOUT terraform:             },
18:22:47.566 STDOUT terraform:         ]
18:22:47.566 STDOUT terraform:       + cors                        = []
18:22:47.566 STDOUT terraform:       + custom_placement_config     = []
18:22:47.566 STDOUT terraform:       + default_event_based_hold    = null
18:22:47.566 STDOUT terraform:       + effective_labels            = {
18:22:47.566 STDOUT terraform:           + goog-terraform-provisioned = "true"
18:22:47.566 STDOUT terraform:           + owner                      = "infrastructure"
18:22:47.566 STDOUT terraform:           + service-name               = "testing-iac"
18:22:47.566 STDOUT terraform:         }
18:22:47.566 STDOUT terraform:       + enable_object_retention     = null
18:22:47.566 STDOUT terraform:       + encryption                  = []
18:22:47.566 STDOUT terraform:       + force_destroy               = true
18:22:47.566 STDOUT terraform:       + hierarchical_namespace      = []
18:22:47.567 STDOUT terraform:       + id                          = (known after apply)
18:22:47.567 STDOUT terraform:       + ip_filter                   = []
18:22:47.567 STDOUT terraform:       + labels                      = {
18:22:47.567 STDOUT terraform:           + owner        = "infrastructure"
18:22:47.567 STDOUT terraform:           + service-name = "testing-iac"
18:22:47.567 STDOUT terraform:         }
18:22:47.567 STDOUT terraform:       + lifecycle_rule              = []
18:22:47.567 STDOUT terraform:       + location                    = "US-CENTRAL1"
18:22:47.567 STDOUT terraform:       + logging                     = []
18:22:47.567 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac-20250606"
18:22:47.567 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
18:22:47.567 STDOUT terraform:       + project_number              = (known after apply)
18:22:47.568 STDOUT terraform:       + public_access_prevention    = "inherited"
18:22:47.568 STDOUT terraform:       + requester_pays              = null
18:22:47.568 STDOUT terraform:       + retention_policy            = []
18:22:47.568 STDOUT terraform:       + rpo                         = (known after apply)
18:22:47.568 STDOUT terraform:       + self_link                   = (known after apply)
18:22:47.568 STDOUT terraform:       + soft_delete_policy          = [
18:22:47.568 STDOUT terraform:           + {
18:22:47.568 STDOUT terraform:               + effective_time             = (known after apply)
18:22:47.568 STDOUT terraform:               + retention_duration_seconds = 604800
18:22:47.568 STDOUT terraform:             },
18:22:47.568 STDOUT terraform:         ]
18:22:47.568 STDOUT terraform:       + storage_class               = "REGIONAL"
18:22:47.568 STDOUT terraform:       + terraform_labels            = {
18:22:47.568 STDOUT terraform:           + goog-terraform-provisioned = "true"
18:22:47.569 STDOUT terraform:           + owner                      = "infrastructure"
18:22:47.569 STDOUT terraform:           + service-name               = "testing-iac"
18:22:47.569 STDOUT terraform:         }
18:22:47.569 STDOUT terraform:       + time_created                = (known after apply)
18:22:47.569 STDOUT terraform:       + timeouts                    = null
18:22:47.569 STDOUT terraform:       + uniform_bucket_level_access = true
18:22:47.569 STDOUT terraform:       + updated                     = (known after apply)
18:22:47.569 STDOUT terraform:       + url                         = (known after apply)
18:22:47.569 STDOUT terraform:       + versioning                  = [
18:22:47.569 STDOUT terraform:           + {
18:22:47.569 STDOUT terraform:               + enabled = false
18:22:47.569 STDOUT terraform:             },
18:22:47.569 STDOUT terraform:         ]
18:22:47.569 STDOUT terraform:       + website                     = (known after apply)
18:22:47.569 STDOUT terraform:     }
18:22:47.569 STDOUT terraform:   + name                       = "eitch-demo-atlantis-terragrunt-testing-iac-20250606"
18:22:47.570 STDOUT terraform:   + url                        = (known after apply)
18:22:47.570 STDOUT terraform: 
18:22:47.570 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:22:47.570 STDOUT terraform: Saved the plan to:
18:22:47.570 STDOUT terraform: ./default.tfplan
18:22:47.570 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:22:47.570 STDOUT terraform:     terraform apply "./default.tfplan"
18:22:47.602 INFO   Shutting down Terragrunt Cache server...
18:22:47.608 INFO   Terragrunt Cache server stopped

18:22:47.678 INFO   Terragrunt Cache server is listening on 127.0.0.1:37747
18:22:47.678 INFO   Start Terragrunt Cache server
18:22:48.419 INFO   Shutting down Terragrunt Cache server...
18:22:48.419 INFO   Terragrunt Cache server stopped
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.eitch-consulting.com/lock?id=eitch-consulting%252Fdemo-atlantis-terragrunt%252Feitch-demo-atlantis-terragrunt%252Fus-central1%252Fservices%252Ftesting-iac%252Fbucket%252Ftesting-iac%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac
  ```
Plan: 1 to add, 0 to change, 0 to destroy.